import React from 'react';
import './App.scss';

const records = [
  {
    "손님": "박진우(hanauser1)",
    "상담분류": "예금",
    "제목": "리틀빅정기예금 상담...",
    "내용": "리틀빅 정기예금 상담, 고금리 상품 관심도 높음, 추...",
    "텔러": "김하나(hnv2001)",
    "상담일시": "18:35:35"
  },
  {
    "손님": "박진우(hanauser1)",
    "상담분류": "예금",
    "제목": "리틀빅정기예금 가입...",
    "내용": "예금 가입 완료",
    "텔러": "김하나(hnv2001)",
    "상담일시": "18:27:43"
  },
  {
    "손님": "박진우(hanauser1)",
    "상담분류": "예금",
    "제목": "적금 상품 상담 후...",
    "내용": "적금 가입완료, 추후 창구 재방문예정",
    "텔러": "김하나(hnv2001)",
    "상담일시": "18:09:47"
  },
  {
    "손님": "박진우(hanauser1)",
    "상담분류": "예금",
    "제목": "리틀빅정기예금 상...",
    "내용": "리틀빅 정기예금 상품 가입 완료 및 높은 예금 관심도...",
    "텔러": "김하나(hnv2001)",
    "상담일시": "18:01:39"
  },
  {
    "손님": "이세준(hanauser3)",
    "상담분류": "연금",
    "제목": "직장인으로 연금가입...",
    "내용": "은퇴 20년을 앞두고 연금가입희망, 상품기간임박, 공격적...",
    "텔러": "김하나(hnv2001)",
    "상담일시": "17:28:29"
  },
  {
    "손님": "김연아(hanauser7)",
    "상담분류": "예금",
    "제목": "스마트뱅킹 예금 희...",
    "내용": "스마트뱅킹에 있는 예금 희망, 전자금융 등록 완료, 상...",
    "텔러": "김하나(hnv2001)",
    "상담일시": "17:26:43"
  },
  {
    "손님": "손흥민(hanauser2)",
    "상담분류": "적금",
    "제목": "하나원큐적금 상담...",
    "내용": "스마트뱅킹적금에 있는 하나원큐적금 문의로, 적금가입완료, 보...",
    "텔러": "김하나(hnv2001)",
    "상담일시": "17:23:55"
  },
  {
    "손님": "박진우(hanauser1)",
    "상담분류": "카드",
    "제목": "체크카드 분실",
    "내용": "체크카드 분실 상담, 재발급 완료, 재발급 시 신용카드...",
    "텔러": "김하나(hnv2001)",
    "상담일시": "17:21:46"
  }
]
;

function Worksteller() {
  return (
      <MainContent records={records} />
  );
}


function MainContent({ records }) {
  return (
    <div className="MainContent">
      <h2>업무 기록 관리</h2>
      <table>
        <thead>
          <tr>
            <th>손님</th>
            <th>상담 분류</th>
            <th>제목</th>
            <th>내용</th>
            <th>텔러</th>
            <th>상담 일시</th>
          </tr>
        </thead>
        <tbody>
          {records.map((record, index) => (
            <tr key={index}>
              <td>{record.손님}</td>
              <td>{record.상담분류}</td>
              <td>{record.제목}</td>
              <td>{record.내용}</td>
              <td>{record.텔러}</td>
              <td>{record.상담일시}</td>
            </tr>
          ))}
        </tbody>
      </table>
      <div className="Footer">
        <p>© 2024 HANAVIEW. ALL RIGHTS RESERVED.</p>
      </div>
    </div>
  );
}
export default Worksteller;